fspiop-transfers/20230807/s2-1691408275386/logs/load-k6-1.log
ce8-b716-8c56884b7a98" source=console
time="2023-08-07T11:44:55Z" level=info msg="86cca31ab9b2b13e0047cd56ca1fe893 WS message received [86cca31ab9b2b13e0047cd56ca1fe893/PUT/transfers/f32ff5af-8160-4076-bed9-9ebb2d16d27f]: SUCCESS_CALLBACK_RECEIVED" source=console
time="2023-08-07T11:44:55Z" level=info msg="1596fb9356f5965276eb1b7c0b7bf63e WS message received [1596fb9356f5965276eb1b7c0b7bf63e/PUT/transfers/dfce9da6-9b28-4ce8-b716-8c56884b7a98]: SUCCESS_CALLBACK_RECEIVED" source=console
time="2023-08-07T11:44:56Z" level=info msg="Env Vars -->\n  K6_SCRIPT_WS_TIMEOUT_MS=2000,\n  K6_SCRIPT_FSPIOP_ALS_ENDPOINT_URL=http://account-lookup-service:4002,\n  K6_SCRIPT_ADMIN_ENDPOINT_URL=http://callback-handler-svc-cl-sim:3001/admin,\n  K6_SCRIPT_ORACLE_ENDPOINT_URL=http://callback-handler-svc-oracle-sim:3001/oracle,\n  K6_SCRIPT_FSPIOP_FSP_POOL=undefined\n" source=console
time="2023-08-07T11:44:56Z" level=info msg="Env Vars -->\n  K6_SCRIPT_WS_TIMEOUT_MS=2000,\n  K6_SCRIPT_FSPIOP_TRANSFERS_ENDPOINT_URL=http://sim-perffsp2:3001/fspiop,\n  K6_SCRIPT_FSPIOP_FSP_POOL=[{\"partyId\":19012345001,\"fspId\":\"perffsp1\",\"wsUrl\":\"ws://sim-perffsp1:3002\"},{\"partyId\":19012345002,\"fspId\":\"perffsp2\",\"wsUrl\":\"ws://sim-perffsp2:3002\"}]\n" source=console

     ✓ TRANSFERS_FSPIOP_POST_TRANSFERS_RESPONSE_IS_202
     ✓ TRANSFERS_E2E_FSPIOP_POST_TRANSFERS_SUCCESS

     █ Post Transfers

     checks.........................: 100.00% ✓ 771470     ✗ 0     
     data_received..................: 120 MB  286 kB/s
     data_sent......................: 789 MB  1.9 MB/s
     group_duration.................: avg=120.28µs min=87.31µs  med=111.99µs max=3.48ms   p(90)=139.49µs p(95)=181.71µs
     http_req_blocked...............: avg=1.73µs   min=888ns    med=1.57µs   max=873.71µs p(90)=2.19µs   p(95)=2.55µs  
     http_req_connecting............: avg=0ns      min=0s       med=0s       max=121.4µs  p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=412.47µs min=275.22µs med=364.82µs max=20.1ms   p(90)=509.05µs p(95)=582.12µs
       { expected_response:true }...: avg=412.47µs min=275.22µs med=364.82µs max=20.1ms   p(90)=509.05µs p(95)=582.12µs
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 385735
     http_req_receiving.............: avg=16.61µs  min=6.2µs    med=15.49µs  max=3.19ms   p(90)=22.84µs  p(95)=26.31µs 
     http_req_sending...............: avg=12.62µs  min=5.47µs   med=12.33µs  max=1.06ms   p(90)=15.6µs   p(95)=17.49µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=383.23µs min=254.35µs med=335.32µs max=19.99ms  p(90)=480.21µs p(95)=550.75µs
     http_reqs......................: 385735  918.411593/s
   ✓ iteration_duration.............: avg=1.85ms   min=1.02ms   med=1.68ms   max=147.05ms p(90)=2.44ms   p(95)=2.64ms  
     iterations.....................: 386253  919.644919/s
     vus............................: 2       min=1        max=2   
     vus_max........................: 2       min=2        max=2   
     ws_connecting..................: avg=736.56µs min=155.26µs med=454.38µs max=36.97ms  p(90)=1.3ms    p(95)=1.41ms  
     ws_msgs_received...............: 385735  918.411593/s
     ws_msgs_sent...................: 385735  918.411593/s
     ws_session_duration............: avg=1.68ms   min=874.53µs med=1.49ms   max=146.73ms p(90)=2.27ms   p(95)=2.43ms  
     ws_sessions....................: 386253  919.644919/s


running (7m00.0s), 0/2 VUs, 386253 complete and 0 interrupted iterations
fspiopTransfers ✓ [ 100% ] 0/2 VUs  7m0s